{"city_longitude ": "-76.5025742", "id": "6f150f0c-3f9b-436d-9b43-3ec245fda39a", "state_abbrev ": "PA", "city ": "Lebanon County", "location ": "Indiantown Gap", "country ": "United States", "longitude ": "-76.5982992", "city_latitude": "40.3666686", "description ": "Hotel Road - In the current state game lands just North West of Indiantown Gap, by Hawk Watch Mnt. Used to be the site of a summer hotel for the rich in the early 1800's.  Through its years it didn't make much money, the owners closed down the hotel for it to later be bought and remade into a boyscout camp.  The hotel suffered a horrifying fire and the majority of the residents inside of it burned to death.  Just up the hill from the hotel is an old abandoned railroad bed.  Along this railroad bed, from the 1600's to late 1800's early 1900's, sat a multitude of mine towns.  One such mine town, about 3 miles from the hotel, was named Raush Gap.  It had a population of about 1,000 people.  This mine town house a family who's only job was to switch the tracks for the trains.  The man in the house fell ill and died, and during a time of morning his wife forgot to switch the tracks.  This lead to a horrific train accident killing upwards of 250 people.  When the wreck was all cleaned up and the bodies buried in a, yet undiscovered because its hidden in the woods behind the current standing cemetery, mass grave.  The towns people turned on the woman for not doing her job and were on their way to lynch the woman.  To their dismay they did not find her, at least not alive, the woman had thrown herself in front of a moving train killing her instantly.  To this day the part of the tracks where the wreck happened you get a heavy feeling of pain on your chest, it is hard to breath, it is always about 20 - 30 degrees cooler than anywhere else.  You can hear the train whistle, and it is stated that you will see a figure of a woman holding a lantern, the lady with the lantern, roaming the tracks, seemingly looking for the train she once lost.  And if she sees you she will rush towards you and if she passes through you, you will die in a car accident that will look like you were hit by a train.", "latitude ": "40.4398111", "state ": "Pennsylvania", "jaccard_score": 0.00017297773304818215}