{"city_longitude ": "-117.2305861", "latitude ": "38.0843774", "description ": "Charles M. Keller, principal from January 1985 - June 1992, learned of strange happenings when he arrived for duty - lights going off for no reason during the day and strange things at night.  Teachers working late or at night would have feelings that someone was watching them, strange rapping sounds, and one teacher saw an apparition of a man. Mr. Keller wrote a ghost story called, \"Jake, The Ghost\", as a Halloween story for the children, teachers, and staff in 1985.  The story brought forth more reports of strange behavior from the staff.  One teacher working late one evening heard scuffing footsteps coming down the hall toward her classroom. When she investigated she saw nothing but the steps were still coming toward her!  She was so scared she climbed out the window, ran across the street to one of the neighbors and called her husband for help!  It was not until the summer of 2006 Mr. Keller learned the identity of the ghost. He is a writer of children's poems and stories and wanted further research on his story of the ghost.  In September 1903 there was a Chinese race riot.  The local labor union for some reason decided to run all the Chinese people out of town.  During the riot a Chinese man by the name of Ping Ling was badly beaten and hit over the right eye with a hatchet.  He decided to walk out of town and leave the area.  He bled to death on the road. That road now is the same one that is between Silver Rim School and the Mormon LDS Church. Silver Rim School was not built until 1980. Where the ghost of Ping Ling was until that time is uncertain. Why he chose to take up residence of the school is another mystery. Mr. Keller is certain Ping Ling means no harm to the people in the building.  He is not seen or heard during the day when there are activities in the school. But at night he is quite active and curious. However, Mr. Keller made many trips back to the school at night, especially during the winter, to check security and the heating system. He never encountered Ping Ling on any of his trips. He could only surmise Ping Ling respected him.", "country ": "United States", "city_latitude": "38.069211", "city ": "Tonopah", "longitude ": "-117.2425833", "state_abbrev ": "NV", "location ": "Silver Rim Ele. School", "id": "e6c6a7ff-4d2f-4e1d-9660-2c5f17684898", "state ": "Nevada", "jaccard_score": 0.00017297773304818215}