{"location ": "Maltby Cemetery", "id": "b706a0a2-96f1-462b-ab21-6638e6fa9abe", "city ": "Duvall / Maltby", "description ": "It is hidden off to the right hand side of the Redmond Duval Road. (20 miles East of Seattle.) It has about 35 grave sights and strange, unexplained things happen there. People have seen women and children, dressed in old, raggedy looking close, wondering around the gravesites. Witnesses have also felt physical things like being hit.February 2005 additional information: There used to be a staircase that began at ground level and descended 13 steps below ground. I believe the legend/story was that it was a below-grade entrance to the opulent tomb of a locally wealthy family. In any case, kids used to get drunk near or in the cemetery and would walk down these steps late at night. It is unsure whether there were doors or simply a dirt wall at the bottom of these steps. Regardless, once you reached the bottom of the stairs and turned around you supposedly no longer saw the cemetery but a vision of Hell. The similarity in this story to yours is that this vision drove the subject to insanity. Anyone watching the subject walk down the stairs witnessed them stop, turn, and fall dumbfounded to their knees. I’ve heard that several children emerged nearly comatose from the steps – many of them never uttered another word. the story goes that these steps were bulldozed over (depending on the age of the storyteller, the bulldozing occurred anywhere from 1992 to the early 1960’s) and that the severe NO TRESPASSING limitations were a result of that. Furthermore, There is rumor of illegal late night expeditions – kids with shovels hoping to unearth Maltby’s 13 Steps to Hell. It is suggested independently researching this ‘tale.’ Either way, it’s a great story.", "country ": "United States", "longitude ": "-122.1440334", "city_latitude": "47.757344", "state ": "Washington", "state_abbrev ": "WA", "latitude ": "47.8012409", "city_longitude ": "-122.0860763", "jaccard_score": 0.00017297773304818215}